# 02

# Exercise 1 เขียน while loop เพื่อพิมพ์จำนวนเต็มตั้งแต่ 1 ถึง 150 จากน้อยไปมาก บรรทัดละจำนวน
i = 1 
while i <= 150:
    print(i)
    i += 1

# Exercise 2 เขียน while loop เพื่อพิมพ์จำนวนเต็มตั้งแต่ 1 ถึง 350 จากน้อยไปมาก บรรทัดละจำนวน โดยเพิ่มจำนวนที่พิมพ์ขึ้นครั้งละ 7
i = 1
while i <= 350:
    print(i)
    i += 7

# Exercise 3 เขียน while loop เพื่อพิมพ์จำนวนเต็มตั้งแต่ 100 ถึง 1050 จากน้อยไปมาก บรรทัดละจำนวน โดยเพิ่มจำนวนที่พิมพ์ขึ้นครั้งละ 10
i  = 100
while i <= 1050:
    print(i)
    i += 10

# Exercise 4 เขียน while loop เพื่อพิมพ์จำนวนเต็มตั้งแต่ 100 ถึง 50 จากมากไปน้อย บรรทัดละจำนวน
i = 100
while i >= 50:
    print(i)
    i -= 1

# Exercise 5 เขียน while loop เพื่อพิมพ์จำนวนเต็มตั้งแต่ 400 ถึง 0 จากมากไปน้อย บรรทัดละจำนวน โดยลดจำนวนที่พิมพ์ลงครั้งละ 11
i = 400
while i >= 0:
    print(i)
    i -= 11

# Exercise 6 เขียน while loop เพื่อให้ทำงานได้เหมือน Exercise 5 แต่ใช้ while True
i = 400
while True:
    if i <= 0:
        break
    else:
        print(i)
        i -= 1