# Conditional Statement

# Exercise 1 เขียน if statement เพื่อตรวจสอบว่า x เป็นคำตอบของสมการ หรือไหม

x = 3

if x**2 - 6*x +9 == 0: 
     print("Yes,", x, "is the answer.") # output : 3
     

'''Exercise 2 กำหนดจำนวนเต็มบวกจำนวนหนึ่งให้ตัวแปร n และเขียน if statement 
เพื่อตรวจสอบว่า n เป็นจำนวนคู่ที่หารด้วย 3 ลงตัวหรือไม่ ถ้าใช่ให้พิมพ์ Yes ถ้าไม่ใช่ให้พิมพ์ No  
(สำหรับแต่ละข้อย่อย ให้ใช้โปรแกรมเดียวกันเพื่อทดสอบ แต่กำหนดจำนวนเต็มบวกให้ตัวแปรต่างกัน)
2.1 กำหนดจำนวนเต็มบวกที่ทำให้พิมพ์ Yes'''

n = 27
if n % 3 == 0 and n % 2 == 0:    
     print('Yes')
else:
     print('No')
     
# 2.2 กำหนดจำนวนเต็มบวกที่ทำให้พิมพ์ No  
n = 6
if n % 3 == 0 and n % 2 == 0:    
     print('Yes')
else:
     print('No')