# 01 Python List

# 1. ประกาศ List ของจำนวนเฉพาะ ให้ชื่อตัวแปรว่า primes โดยมีข้อมูลเป็นจำนวนเฉพาะ 10 จำนวนแรก
primes = [2,3,5,7,11,13,17,19,23,29]

# 2. ประกาศ List ของข้อมูลใด ๆ ให้ชื่อตัวแปรว่า data โดยมีข้อมูล 15 ตัว
data = ['a','a','a','a','a','a','a','a','a','a','a','a','a','a','a']
print(len(data)) # len เอาไว้เช็คจำนวน item ใน list

# 3. ประกาศ List ของที่เก็บข้อมูลเดือนทั้ง 12 เดือนใน 1 ปี (ตั้งแต่มกราคม ถึง ธันวาคม ตามลำดับ) ให้ชื่อตัวแปรว่า months โดยเก็บชื่อเดือน 3 ตัวแรกของแต่ละเดือนเป็นตัวพิมพ์ใหญ่ทั้งหมด (เช่น JAN สำหรับเดือนมกราคม)
months = ['JAN','FEB','MAR','APR','MAY','JUN','JUL','AUG','SEP','OCT','NOV','DEC']